Repository: wpaczesniak/Articles_Energy_Flutter
Catalog: lib/l10n/app_*.arb
Languages: pl

# title
source: Energy news
pl: Artykuły OZE

source: Hello World!
pl: Witaj Świecie!

# smallTitle
source: small Text
pl: Mały Tekst

# mediumTitle
source: medium Text
pl: Średni Tekst

# largeTitle
source: large Text
pl: Duży Tekst

# hugeTitle
source: huge
pl: Ogromny tytył

source: Location
pl: Lokalizacja

source: Profile
pl: Profil

source: Person
pl: Osoba

# web
source: Website
pl: Strona Internetowa

# login
source: Login Google
pl: Logowanie przez Googla

# correct
source: Logged in successfully
pl: Zalogowany pomyślnie

# firstTitleArticle
source: Floating Photovoltaic
pl: Pływające ogniwa fotowoltaiczne

# secondTitleArticle
source: Record efficiency of PV cell
pl: Rekordowa sprawność ogniwa

# thirdTitleArticle
source: Negative electricity prices
pl: Ujemne ceny energii elektrycznej

# fourthTitleArticle
source: Energy mix in Poland
pl: Produkcja energii w Polsce

# secondDescriptionArticle
source: A Chinese manufacturer has set a new record for the efficiency of a photovoltaic cell made of silicon. In doing so, it has improved on its record set a year earlier. In November 2022, Chinese photovoltaic cell and panel manufacturer LONGi announced that it had achieved an efficiency record for a full-size, multi-junction HJT cell. On the Chinese manufacturer's full-size cell, the German institute ISFH measured an efficiency of 26.81 percent. At the time, this was a global record for the efficiency of a cell made of silicon, and no better result had been achieved on a full-size silicon PV cell for more than a year. Now the Chinese manufacturer has improved on its achievement from late 2022. An efficiency of 27.09 percent was measured on a silicon cell supplied by LONGi, a result that was to be achieved in tests performed again by ISFH. The record-breaking cell was made using a technology referred to as HBC (Heterojunction Back Contact).
pl: Jeden z chińskich producentów ustanowił nowy rekord sprawności ogniwa fotowoltaicznego wykonanego z krzemu. Poprawił tym samym swój rekord ustanowiony rok wcześniej. W listopadzie 2022 r. chiński producent ogniw i paneli fotowoltaicznych LONGi ogłosił osiągnięcie rekordu sprawności pełnowymiarowego, wielozłączowego ogniwa HJT. Na pełnowymiarowym ogniwie chińskiego producenta niemiecki instytut ISFH zmierzył sprawność 26,81 proc. Był to wówczas globalny rekord sprawności ogniwa wykonanego z krzemu i przez ponad rok na pełnowymiarowym krzemowym ogniwie PV nie osiągnięto lepszego wyniku. Teraz chiński producent poprawił swoje osiągnięcie z końca 2022 roku. Na krzemowym ogniwie dostarczonym przez LONGi została zmierzona sprawność wynosząca 27,09 proc. Taki wynik miał zostać uzyskany w testach wykonanych ponownie przez ISFH. Rekordowe ogniwo zostało wykonane w technologii określanej jako HBC (Heterojunction Back Contact).

# thirdDescriptionArticle
source: The prevailing weather conditions over the holidays were conducive to high wind power production. However, the operation of some wind power plants was reduced at the behest of the Polish Power Grid, which once again had to manage the surplus energy in the National Power System over the holidays. On December 25 in the afternoon, the total power with which wind farms in Poland were operating exceeded even 8.2 GW and was close to a record. With similar power, windmills also worked the next day in the afternoon. On the first and second days of the holidays, photovoltaic power plants also provided additional power during the midday hours. They worked - despite considerable cloud cover - with a power output exceeding even 2 GW (in addition, generation from some PV installations was consumed immediately "behind the meter" in the homes of prosumers). Due to the high production and the holiday drop in energy demand, the Polish Power Grid (PSE) decided to reduce generation from some generation sources and had to launch emergency power exports to neighboring countries.
pl: Panujące w święta warunki pogodowe sprzyjały wysokiej produkcji energii wiatrowej. Praca części elektrowni wiatrowych została jednak zredukowana na zlecenie Polskich Sieci Elektroenergetycznych, które już po raz kolejny w okresie świąt musiały zarządzać nadwyżką energii w Krajowym Systemie Elektroenergetycznym. W dniu 25 grudnia w godzinach popołudniowych łączna moc, z jaką pracowały farmy wiatrowe w Polsce, przekraczała nawet 8,2 GW i była blisko rekordu. Ze zbliżoną mocą wiatraki pracowały również następnego dnia po południu. W pierwszy i drugi dzień świąt w godzinach południowych dodatkową moc zapewniały też elektrownie fotowoltaiczne. Pracowały one – mimo sporego zachmurzenia – z mocą przekraczającą nawet 2 GW (dodatkowo generacja z części instalacji PV była konsumowana od razu „za licznikiem” w domach prosumentów). Z powodu wysokiej produkcji oraz świątecznego spadku zapotrzebowania na energię Polskie Sieci Elektroenergetyczne (PSE) zdecydowały się na zredukowanie generacji z części źródeł wytwórczych i musiały uruchomić awaryjny eksport energii do krajów sąsiednich.

# fourthDescriptionArticle
source: According to preliminary data from PSE, ARE and ENTSOE, analyzed by WysokieNapiecie.pl, Poland produced nearly 166 TWh of electricity in 2023. Of this, as much as 44 TWh came from renewable energy sources, half of which were supplied by onshore wind farms. The share of coal in Poland's electricity production in 2023 fell to 63%, the share of renewables rose to 27%, and the share of gas reached 10%. While the share of gas remains at the level we already saw in 2020, coal and renewables showed the fastest changes ever. Renewable energy sources increased their share of the country's energy mix from 20% to 27% within a year, while coal's share shrank from 73% to 63%, reaching the lowest level in the more than 100-year history of Poland's electric power industry. This is the rate assumed in the latest (created after Russia's aggression against Ukraine and the outbreak of the Russia-EU fuel war), scenario of the Ministry of Climate and Environment. Indeed, the update to Poland's Energy Policy, which is being prepared, assumes that over the next decade the share of coal will fall further at a similar rate, up to less than 20% in 2035.
pl: Według wstępnych danych PSE, ARE i ENTSOE, przeanalizowanych przez portal WysokieNapiecie.pl, w 2023 roku Polska wyprodukowała niemal 166 TWh energii elektrycznej. W tym aż 44 TWh pochodziło z odnawialnych źródeł energii, z czego połowę dostarczyły lądowe farmy wiatrowe. Udział węgla w produkcji energii elektrycznej w Polsce w 2023 roku spadł do 63%, udział źródeł odnawialnych wzrósł do 27%, a udział gazu sięgnął 10%. O ile udział gazu pozostaje na poziomie, jaki obserwowaliśmy już w 2020 roku, o tyle węgiel i źródła odnawialne wykazały się najszybszymi zmianami w historii. Odnawialne źródła energii w ciągu roku zwiększyły swój udział w krajowym miksie energetycznym z 20% do 27%, podczas gdy udział węgla skurczył się z 73% do 63%, osiągając najniższy poziom w ponad 100-letniej historii polskiej elektroenergetyki. To tempo zakładane w najnowszym (powstałym po agresji Rosji na Ukrainę i wybuchu wojny paliwowej na linii Rosja-UE), scenariuszu Ministerstwa Klimatu i Środowiska. Przygotowywana aktualizacja Polityki energetycznej Polski zakłada bowiem, że w ciągu najbliższej dekady udział węgla będzie spadać w podobnym tempie dalej, aż do poziomu niespełna 20% w 2035 roku.
